const rightLittleFinger1={"name":"zxz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[0,0,0,[0,0,0],[0,0,0]]},{"frame":30.660778733018397,"values":[0.23639976053760353,-0.001436414394798093,0.0017775879691526973,[0,0,0],[0,0,0],0]},{"frame":59.95752765470485,"values":[-0.0027687375528240962,0.0036592671750771658,0.00044526481112494234,[0,0,0],[0,0,0]]}],"ranges":[]}
const rightLittleFinger2={"name":"zxz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[0.23639976053760353,-0.001436414394798093,0.0017775879691526973,[0,0,0],[0,0,0]]},{"frame":30.660778733018397,"values":[-0.0027687375528240962,0.0036592671750771658,0.00044526481112494234,[0,0,0],[0,0,0],0]},{"frame":59.95752765470485,"values":[0.23639976053760353,-0.001436414394798093,0.0017775879691526973,[0,0,0],[0,0,0]]}],"ranges":[]}
const rightHand={"name":"zxz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[-0.20057548967693295, -0.833596275205426,0.20414271746423518,[0,0,0],[0,0,0]]},{"frame":30.660778733018397,"values":[-0.3240162870407959,-0.7609221129375321, 0.12354577851195803,[0,0,0],[0,0,0],0]},{"frame":59.95752765470485,"values":[-0.20057548967693295, -0.833596275205426,0.20414271746423518,[0,0,0],[0,0,0]]}],"ranges":[]}
const gear={"name":"zxz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[3.141592653589793,0.003998787223963074, 1.551165916786351,[0,0,0],[0,0,0]]},{"frame":30.660778733018397,"values":[3.043355444260878,0.003998787223963074, 1.551165916786351,[0,0,0],[0,0,0],0]},{"frame":59.95752765470485,"values":[3.141592653589793,0.003998787223963074, 1.551165916786351,[0,0,0],[0,0,0]]}],"ranges":[]}
const foreArm={"name":"zxz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[2.8549701955678897,2.3160552010498705, 1.4286747288144346,[0,0,0],[0,0,0]]},{"frame":30.660778733018397,"values":[2.839999758845173,2.279620702803556, 1.4701842885212209,[0,0,0],[0,0,0],0]},{"frame":59.95752765470485,"values":[2.8549701955678897,2.3160552010498705, 1.4286747288144346,[0,0,0],[0,0,0]]}],"ranges":[]}
const keyboard='1、手指形态及手指键位对应关系\n' +
  '将左手食指、中指、无名指、小指分别置于F、D、S、A键上，左手拇指自然向掌心弯曲;将右手食指、中指、无名指、小指分别置于J、K、L、;键上，右手拇指轻置于空格键上。\n' +
  '\n' +
  '手腕放平，从手腕到指尖的手指形态成弧形，指端第一关节与键盘成垂直角度。\n' +
  '\n' +
  '打字前手指甲必须修平，不能用指甲触键。\n' +
  '\n' +
  '2、瞬间发力击键\n' +
  '操作电脑键盘时，主要的用力部位是指关节，而不是手腕。这是初学时的基本要求。待练到高级阶段，手指敏感度增强，才发展为指力与腕力相结合。\n' +
  '\n' +
  '以指端垂直向键盘使用冲击力，要在瞬间发力，并立即反弹。能否体会和掌握这个要领，是学习打字技能成败的关键。在打空格键时，也应注意瞬间发力，立即反弹，要体会和掌握手指动作的运动规律和协调性，使打键有节奏感。\n' +
  '\n' +
  '3、在手形和击键方面可能出现的以下常见错误\n' +
  '不是击键，而是按键，一直压到底，没有弹性，迟迟不起来。\n' +
  '腕部呆滞，不能与手指跳动配合，既影响手形，也不可能做到击键迅速、声音清脆。\n' +
  '击键时手指形态变形，手指翘起或向里勾，手形掌握不住是初学时常见的现象。\n' +
  '左手击键时，右手离开基本键，搁在键盘边框上。\n' +
  '将手腕搁在桌子上打键，打字必须悬腕，和书法练习有相近之处。\n' +
  '小指、无名指缺少力量，控制不住。\n' +
  '眼看键盘，打字动作没有节奏感。';
const keyboardPlay='开始打字之前一定要端正坐姿。标准正确的打字姿势对身体身体各部位的健康有着重要的保护作用，如果你每日都长时间地坐在电脑前，那么一些不良的姿势会给你的身体带来极大的伤害，并且对打字速度也有很大影响。正确的坐姿应该是：\n' +
  '\n' +
  '1、屏幕及键盘应该在你的正前方﹐不应该让脖子及手腕在于斜的状态。\n' +
  '\n' +
  '2、屏幕的中心应比您眼睛的水平低﹐屏幕离眼睛最少要有一个手臂的距离。\n' +
  '\n' +
  '3、要坐就坐直的﹐不要半坐半躺，不要让您的身体坐为角度不正的姿势。\n' +
  '\n' +
  '4、大腿应尽量保持于前手臂平行的姿势。\n' +
  '\n' +
  '5、手、手腕及手肘应保持在一条直线上。\n' +
  '\n' +
  '6、双脚轻松平稳放在地板或脚垫上。\n' +
  '\n' +
  '7、打教材或文稿放在键盘的左边，或用专用夹，夹在显示器旁边。打字时眼观文稿，身体不要跟着倾斜。\n' +
  '\n' +
  '8、显示器的亮度和对比度要调整到清晰但又不刺眼的程度。\n' +
  '\n' +
  '9、适时的休息一下。';

export {
   rightLittleFinger1,
   rightLittleFinger2,
   rightHand,
   gear,
   foreArm,
   keyboard,
   keyboardPlay,}