//左食指
const leftThumb1={"name":"ymz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[0.0037784780751470575,0.002454665956400752,-0.3007160186678077,[0,0,0],[0,0,0]]},{"frame":61.54305602825869,"values":[0.2960795093556251,0.004619725334102519,-0.30384312369102734,[0,0.00017805589138141992,0.00000785960997267535],[0,0.00017805589138141992,0.00000785960997267535],0]},{"frame":128.22064882694306,"values":[0.01972927899483414,0.0004452648111252608,-0.30335554081473004,[0,0,0],[0,0,0]]}],"ranges":[]}
const leftIndexFinger1={"name":"zsz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[0.016070011819756657,0.0096420070918546,0.009642007091854282,[0,0,0],[0,0,0]]},{"frame":28.50598573985493,"values":[0.2575654539272358,0.01008727190298002,0.013301274266932084,[0,0,0],[0,0,0],0]},{"frame":59.12151979162377,"values":[0.01651527663087985,0.01008727190298002,-0.0027687375528250516,[-0.009962002289132002,0,0]]}],"ranges":[]}
const leftMiddleFinger1={"name":"zzz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[0,0,0,[0,0,0],[0,0,0]]},{"frame":30.640942460609388,"values":[0.23577497733775443,0.0017042775505461793,0.0009073421117157226,[0,0.00029055442085542706,0.0001546885727050822],[0,0.00029055442085542706,0.0001546885727050822],0]},{"frame":59.52070068366532,"values":[0.010087271902978586,0.006873269539029389,0.0036592671750770066,[0,0,0],[0,0,0]]}],"ranges":[]}
const leftRingFinger1={"name":"zwmz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[0,0,0,[0,0,0],[0,0,0]]},{"frame":29.3625657701421,"values":[0.257593894307919,0.0032974586220645536,0.0032194088353265237,[0,0.0000420329429343347,0.00000272298216889043],[0,0.0000420329429343347,0.00000272298216889043],0]},{"frame":59.37509169331876,"values":[0.013301274266930492,0.006873269539029708,0.0004452648111266938,[0,0,0],[0,0,0]]}],"ranges":[]}
const leftLittleFinger1={"name":"zxz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[0,0,0,[0,0,0],[0,0,0]]},{"frame":30.660778733018397,"values":[0.23639976053760353,-0.001436414394798093,0.0017775879691526973,[0,0,0],[0,0,0],0]},{"frame":59.95752765470485,"values":[-0.0027687375528240962,0.0036592671750771658,0.00044526481112494234,[0,0,0],[0,0,0]]}],"ranges":[]}
const zuoshouzhou={"name":"ss","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[-0.04610812805967786,0.6898485313544168,-0.2634452715432788,[0,0,0],[0,0,0]]},{"frame":94.35711168629082,"values":[-0.04952155882932327,0.689448193678059,-0.26398398440123194,[0,0,0],[0,0,0]]}],"ranges":[]}
const zuoxiaozhi={"name":"dd","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[-0.04289377574015064,0.004595761686444683,-0.08885139260459747,[0,0,0],[0,0,0]]},{"frame":44.725371993374836,"values":[0.15146598024256042,0.00672411000403607,-0.08442242756772972,[-0.0006366254890730078,0.00007293675211336094,0.00015177700113407056],[-0.0006366254890730078,0.00007293675211336094,0.00015177700113407056]]},{"frame":84.10671298003739,"values":[-0.0340463794500626,0.008847396290088043,-0.08000399631450927,[0,0,0],[0,0,0]]}],"ranges":[]}
//右食指
const rightThumb1={"name":"ymz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[0.0037784780751470575,0.002454665956400752,-0.3007160186678077,[0,0,0],[0,0,0]]},{"frame":61.54305602825869,"values":[0.2960795093556251,0.004619725334102519,-0.30384312369102734,[0,0.00017805589138141992,0.00000785960997267535],[0,0.00017805589138141992,0.00000785960997267535],0]},{"frame":128.22064882694306,"values":[0.01972927899483414,0.0004452648111252608,-0.30335554081473004,[0,0,0],[0,0,0]]}],"ranges":[]}
const rightIndexFinger1={"name":"ysz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[0,0,0,[0,0,0],[0,0,0]]},{"frame":31.38882368475103,"values":[0.2509381959300964,0.0055929293608052875,0.003810912541993801,[0,0.00025599902214236197,0.0001744327205448573],[0,0.00025599902214236197,0.0001744327205448573],0]},{"frame":59.666309674011785,"values":[0.01651527663088176,0.010087271902979224,0.00687326953902923,[0,0,0],[0,0,0],0]}],"ranges":[]}
const rightMiddleFinger1={"name":"yzz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[0,0,0,[0,0,0],[0,0,0]]},{"frame":48.57068454564122,"values":[0.20593186908448086,0.002011975317402911,-0.0015223353065315643,[0,0.00005758047688792506,-0.00004356752897275192],[0,0.00005758047688792506,-0.00004356752897275192],0]},{"frame":91.26346057920823,"values":[0.010087271902980179,0.003659267175076847,-0.0027687375528255296,[0,0,0],[0,0,0],0]}],"ranges":[]}
const rightRingFinger1={"name":"ywmz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[0,0,0,[0,0,0],[0,0,0]]},{"frame":59.64933547679533,"values":[0.2233738555338958,-0.0009317673305975385,-0.0017288232057550458,[0,-0.0000207670640077099,0],[0,-0.0000207670640077099,0],0]},{"frame":132.33668900119375,"values":[0.0004944910179102997,-0.0018511116619986494,-0.0015022064684580734,[0,0,0],[0,0,0],0]}],"ranges":[]}
const rightLittleFinger1={"name":"zxz","property":"rotation","framePerSecond":60,"dataType":1,"loopBehavior":1,"blendingSpeed":0.01,"keys":[{"frame":0,"values":[0,0,0,[0,0,0],[0,0,0]]},{"frame":30.660778733018397,"values":[0.23639976053760353,-0.001436414394798093,0.0017775879691526973,[0,0,0],[0,0,0],0]},{"frame":59.95752765470485,"values":[-0.0027687375528240962,0.0036592671750771658,0.00044526481112494234,[0,0,0],[0,0,0]]}],"ranges":[]}

const read='1、坐姿要领\n' +
  '        两脚自然着地与肩同宽，两小腿自立与大腿约成90度；上体自然端正，微向前倾，距桌沿约15厘米；两小臂放于桌面，左手扶抄报纸，右手握笔；两眼目视抄报纸。\n' +
  '\n' +
  '2、握姿要领\n' +
  '        右手拇指（指肚）、中指第一关节与食指相邻的一侧和食指指尖内侧合捏处呈一正三角形，外侧略成平面，距笔尖约3厘米左右；无名指和小指自然曲回掌心，笔身考住食指第三关节后部，倾斜与桌面夹度约45度，虎口向左上方，手掌右侧轻贴纸面。\n' +
  '\n' +
  '3、铅笔削法\n' +
  '        左手握笔，右手持刀，距铅笔顶端2.5公分处开始削，左手拇指向前推刀，右手掌握削的厚度，边削边转动铅笔，将铅笔的木质削成圆锥形，使笔芯露出0.5公分，最后将铅笔芯削好。\n' +
  '\n' +
  '4、书写要求\n' +
  '        笔路正确、字迹清晰、流畅圆润、排列整齐、大小适中、不连不草、美观端正、清楚正规。字体在书写时一般向右倾斜20度左右。\n' +
  '        书写数码时，码子高度约占电报纸格子的四分之三，每个格子应靠近格子的底线，并向格子左边靠拢，一组数码的宽度约占格子的五分之四1。';
const read2='1、收报要领\n' +
  '        集中精力，平心静气，边听边写，压码稳抄。集中精力，平心静气，收报前，应做好一切准备工作，以免在收报时分散精力，收报时，必须集中思路，全神贯注，抓住信号特点，听清一字一码，力争不掉不错。集中精力收报的同时，要平心静气，切不可精神紧张，无论发快发慢或抄收出现什么情况，都要从容应付，沉着抄收。当出现错掉时，切不可忙乱，应继续专心听辨，耐心抄收，边听边写、压码稳抄，通常称流水式抄收，流水式抄收方法是在听到第二码或第三码时在抄收第一码，始终在记忆中压住一至数个电码，这样不断的抄收下去。这就要求耳朵不停地听，大脑不间断地迅速反应，手不停的抄写。这种抄收方法的好处时抄收稳定，由于抄收中压一至数个电码，因此有余力写好码子，便于做错掉标记，无论对方发快发慢或抄收中出现各种情况，都能从容应付。要掌握流水式抄收方法，需要决心和一个刻苦实践的过程，应坚持锻炼，持之以恒，否则便无法在抄收中获得自由。\n' +
  '\n' +
  '2、运笔要领\n' +
  '       书写时，以右手拇指、食指、中指的合力随字体字形的变化而自然伸缩，以肘为轴逐渐向右移动，握笔不要太紧，用力不宜太重，要紧松适当，轻重合适，手指手腕应同时动作，不能单靠手腕来运动，否则就会影响字体的质量和速度，也容易疲劳，影响持久抄收。书写时要经常转动铅笔，以免越写越粗，但要注意转动铅笔时不影响抄收。\n' +
  '\n' +
  '3、抄收字体\n' +
  '        抄收字体时收报的基本功，字体书写得好不好，关系到抄收的质量、准确性和速度，我们要在掌握运笔要领的基础上，一丝不苟，刻苦地按照字体的书写要求练好抄收字体。\n' +
  '        1）、抄收字体书写要求\n' +
  '                正规，字体书写得符合规定型，起落笔路要正确。\n' +
  '                整齐，字体的大小、斜度、间隔要一致。\n' +
  '                清楚，字与字不要太挤和相连，更不能潦草，起落笔时笔锋不要太长，报面要整洁。\n' +
  '                流利，书写字体要轻快圆滑，有轻有重，轻重适当。\n' +
  '        2）、抄收字体及笔路\n' +
  '                为了使报面整洁醒目，字体要写得合乎规格。书写时一般应向右倾斜20度左右，高度约占电报纸格子的四分之三，每个字应靠近格子的底线，并向格子的左边靠拢，一组字的宽度约占格子的五分之四，抄混合码电报时，数码应相应地写大些（在三格纸中数码占上、中两格）。要求不连不草，字体清除，排列整齐';
export {
   leftThumb1,
   leftIndexFinger1,
   leftMiddleFinger1,
   leftRingFinger1,
   leftLittleFinger1,
   rightThumb1,
   rightIndexFinger1,
   rightMiddleFinger1,
   rightRingFinger1,
   rightLittleFinger1,
   zuoshouzhou,
   zuoxiaozhi,
   read,
   read2
}