export default {
  mistake: [
    {
      title: '行内改错',
      example: [
        {
          title: '剩余字码替换成/+间隔(空格)+正确报文。',
          example: ['5/// 1234', '15// 1234', '125/ 1234']
        },
        {
          title: '第四码拍错未拍发间隔(空格)马上拍发/+完整的正确报文。',
          example: ['1235/1234']
        },
        {
          title: '第四码拍错已拍发间隔(空格) 继续拍发四个/+间隔+完整的正确报文。',
          example: ['1235 //// 1234']
        }
      ],
      question: [
        {
          title: '第一码发错，拍发三个斜线一个间隔。',
          example: '5/// 6835',
          value: '',
          question: '正确报文为 6835 已输入报文 5 请修改？'
        },
        {
          title: '第二码发错，拍发两个斜线一个间隔。',
          example: '65// 6835',
          value: '',
          question: '正确报文为 6835 已输入报文 65 请修改？'
        },
        {
          title: '第三码发错，拍发一个个斜线一个间隔。',
          example: '682/ 6835',
          value: '',
          question: '正确报文为 6835 已输入报文 682 请修改？'
        },
        {
          title: '第四码发错，拍发一个斜线不拍发间隔。',
          example: '6833/6835',
          value: '',
          question: '正确报文为 6835 已输入报文 6833 未拍发间隔请修改？'
        },
        {
          title: '第四码发错且已拍发间隔，就要拍发四个斜线一个间隔。',
          example: '6832 //// 6835',
          value: '',
          question: '正确报文为 6835 已输入报文 6830 且已经拍发间隔请修改？'
        }
      ]
    },
    {
      title: '行尾改错',
      example: [
        {
          title: '拍发完本行最后一组报文后，拍发间隔+错误报文的组数+间隔+正确报文。',
          example: ['0000 ... 4444 ... 9999 4 1234']
        }
      ],
      question: [
        {
          example: '5 4444',
          value: '',
          question: '正确报文为 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 已输入报文 0000 1111 2222 3333 3333 5555 6666 7777 8888 9999 请修改？'
        }
      ]
    },
    {
      title: '页尾修改',
      example: [
        {
          title: '拍发完分页符后换行输入要修改的组数+间隔+正确报文。',
          example: ['0000 ... 4444 ... 9999-1', '24 1234']
        }
      ],
      question: [
        {
          example: '24 1234',
          value: '',
          question: '拍发过程发现第 24 码报文拍发错误正确报文为 1234 且已经拍发分页符号请修改？'
        }
      ]
    },
    {
      title: '隔页修改',
      example: [
        {
          title: '拍发完分页符后换行输入要修改的报文所在的页数（1P）+间隔+组数+间隔+正确报文。',
          example: ['0000 ... 4444 ... 9999-2', '1P 24 1234']
        }
      ],
      question: [
        {
          example: '1P 24 1234',
          value: '',
          question: '拍发第二页时发现第一页第 24 码报文拍发错误正确报文为 1234 且已经拍发分页符号请修改？'
        }
      ]
    }
  ],
  group: [
    {
      title: '行尾改错',
      example: [
        {
          title: '（少组）拍发完本行最后一组报文后，拍发间隔+增加单词（add）+间隔+组数+间隔+正确报文。',
          example: ['0000 1111 2222 3333  5555 6666 7777 8888 9999 add 5 4444']
        },
        {
          title: '（多组）拍发完本行最后一组报文后，拍发间隔+取消单词（qta）+间隔+组数。',
          example: ['0000 1111 2222 3333 4444 4444 5555 6666 7777 8888 9999 qta 5']
        }
      ],
      question: [
        {
          example: 'add 5 4444',
          value: '',
          question: '正确报文为 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 已输入报文 0000 1111 2222 3333  5555 6666 7777 8888 9999 请修改？'
        },
        {
          example: 'qta 5',
          value: '',
          question: '正确报文为 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 已输入报文 0000 1111 2222 3333 4444 4444 5555 6666 7777 8888 9999 请修改？'
        }
      ]
    },
    {
      title: '页尾改错',
      example: [
        {
          title: '（少组）拍发完分页符后换行，拍发间隔+增加单词（add）+间隔+组数+间隔+正确报文。',
          example: ['0000 1111 2222 3333  5555 6666 7777 8888 9999-1', 'add 5 4444']
        },
        {
          title: '（多组）拍发完分页符后换行，拍发间隔+取消单词（qta）+间隔+组数。',
          example: ['0000 1111 2222 3333 4444 4444 5555 6666 7777 8888 9999-1 ', 'qta 5']
        }
      ],
      question: [
        {
          example: 'add 5 4444',
          value: '',
          question: '正确报文为 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999-1 已输入报文 0000 1111 2222 3333  5555 6666 7777 8888 9999-1 请修改？'
        },
        {
          example: 'qta 5',
          value: '',
          question: '正确报文为 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999-1 已输入报文 0000 1111 2222 3333 4444 4444 5555 6666 7777 8888 9999-1 请修改？'
        }
      ]
    }
  ],
  line: [
    {
      title: '页尾改错',
      example: [
        {
          title: '（少行）报文中出现多行的情况可以在页尾进行修改，拍发增加单词（add）+间隔+xx组———xx组+换行（Enter）+要添加的哪一行报文。',
          example: ['0000 1111 2222 3333 444 5555 6666 7777 8888 9999-1', 'add 21---30', '0000 ...... 9999']
        },
        {
          title: '（多行）报文中出现多行的情况可以在页尾进行修改，拍发取消单词（qta）+间隔+xx组———xx组。',
          example: ['0000 1111 2222 3333  5555 6666 7777 8888 9999-1', 'qta 21---30']
        }
      ],
      question: [
        {
          example: 'add 11-20 Enter 0000 1111 2222 3333 444 5555 6666 7777 8888 9999',
          value: '',
          question: '拍发报文时发现漏拍了第二行报文，第二行报文为（0000 1111 2222 3333 444 5555 6666 7777 8888 9999）请修改？'
        },
        {
          example: 'qta 11-20',
          value: '',
          question: '拍发报文时发现第二行报文为多拍发了的报文请修改？'
        }
      ]
    }
  ],
  page: [
    {
      title: '页尾修改',
      example: [
        {
          title: '忘记标页，且已回动换行，拍发出第100组的组位数和报文以及页标符号和页数。',
          example: ['0000 .... 9999 ', '100 9999-1']
        },
        {
          title: '标页错误，且已回动换行，拍发出第100组的组位数和报文以及页标符号和页数。',
          example: ['0000 ...... 9999-2', '100 9999-1']
        },
        {
          title: '标页错误，且已拍发间隔，可按第一百组报文拍发错误处理。',
          example: ['0000 ...... 9999-2', '0000 ...... 9999-2 //// 9999-1']
        },
        {
          title: '标页错误未拍发间隔和换行，直接/+正确的页数。',
          example: ['0000 ...... 9999-2/1']
        }
      ],
      question: [
        {
          example: '100 1234-1',
          value: '',
          question: '拍发完第一页最后一组报文时发现漏拍了页标且已回动换行，该页最后一组报文为 1234 请修改？'
        },
        {
          example: '1234-2/1',
          value: '',
          question: '在拍发第一页标页时发现标页错误且未拍发间隔和换行，实际拍发的报文为 1234-2 请修改？'
        },
        {
          example: '1234-2 //// 1234/1',
          value: '',
          question: '在拍发第一页标页时发现标页错误且拍发了间隔，实际拍发的报文为 1234-2 请修改？'
        },
        {
          example: '100 1234-1',
          value: '',
          question: '在拍发第一页标页时发现标页错误且拍发了换行，实际拍发的报文为 1234-2 请修改？'
        }
      ]
    },
    {
      title: '隔页修改',
      example: [
        {
          title: '拍发完分页符后换行输入要修改的标错页所在页数（1P）+间隔+组数+间隔+正确报文。',
          example: ['0000 .... 2222-2 ', '1P 100 1111-1']
        }
      ],
      question: [
        {
          example: '1P 100 1234-1',
          value: '',
          question: '拍发完第二页分页后发现第一页标页错误，该页最后一组报文为 1234 请修改？'
        }
      ]
    }
  ],
  question: [
    {
      title: '请使用" / "并且不拍发间隔的方式修改以下错误的报文，并完善后续报文。',
      value: '0000 1111 2222 3333 4544',
      code: ['0000', '1111', '2222', '3333', '4444', '5555', '6666', '7777', '8888', '9999'],
      anwser: '0000 1111 2222 3333 4544',
      compileCode: '0000 1111 2222 3333 4544     ',
      fun: change1
    },
    {
      title: '请使用" / "且拍发间隔并且非"////"的方法修改以下错误的报文，并完善后续报文。',
      value: '0000 1111 2222 3333 45',
      code: ['0000', '1111', '2222', '3333', '4444', '5555', '6666', '7777', '8888', '9999'],
      anwser: '0000 1111 2222 3333 45',
      compileCode: '0000 1111 2222 3333 45     ',
      fun: change2
    },
    {
      title: '请使用" / "且拍发间隔的方法修改以下报文，并完善后续报文。',
      value: '0000 1111 2222 3333 4544',
      code: ['0000', '1111', '2222', '3333', '4444', '5555', '6666', '7777', '8888', '9999'],
      anwser: '0000 1111 2222 3333 4544',
      compileCode: '0000 1111 2222 3333 4544     ',
      fun: change3
    },
    {
      title: '请在行尾修改下图中错误的报文。',
      value: '0000 1111 2222 3333 4544 5555 6666 7777 8888 9999',
      code: ['0000', '1111', '2222', '3333', '4444', '5555', '6666', '7777', '8888', '9999'],
      anwser: '0000 1111 2222 3333 4544 5555 6666 7777 8888 9999',
      compileCode: '0000 1111 2222 3333 4544 5555 6666 7777 8888 9999',
      fun: change4
    },
    {
      title: '请在页尾修改下图中错误的报文。',
      value: '',
      code: ['...(90)', '0000', '1111', '2222', '3333', '4444', '5555', '6666', '7777', '8888', '9999-1'],
      anwser: '95 4444',
      compileCode: '...(90) 0000 1111 2222 3333 4544 5555 6666 7777 8888 9999-1',
      fun: change5
    },
    {
      title: '如下图所示，在拍发完第二页报文时，发现第一页某组报文拍发错误，请进行更正。',
      value: '',
      code: ['...(90)', '0000', '1111', '2222', '3333', '4444', '5555', '6666', '7777', '8888', '9999-1', '...(199)', '2000-2'],
      anwser: '1P 95 4444',
      compileCode: '...(90) 0000 1111 2222 3333 4544 5555 6666 7777 8888 9999-1 ...(199) 2000-2',
      fun: change6
    },
    {
      title: '请在行尾修改下图中漏拍（少组）的报文。',
      value: '0000 1111 2222 3333  5555 6666 7777 8888 9999',
      code: ['0000', '1111', '2222', '3333', '4444', '5555', '6666', '7777', '8888', '9999'],
      anwser: '0000 1111 2222 3333  5555 6666 7777 8888 9999',
      compileCode: '0000 1111 2222 3333  5555 6666 7777 8888 9999',
      fun: change7
    },
    {
      title: '请在行尾修改下图中多拍（多组）的报文。',
      value: '0000 1111 2222 3333 4444 4444 5555 6666 7777 8888 9999',
      code: ['0000', '1111', '2222', '3333', '4444', '5555', '6666', '7777', '8888', '9999'],
      anwser: '0000 1111 2222 3333 4444 4444 5555 6666 7777 8888 9999',
      compileCode: '0000 1111 2222 3333 4444 4444 5555 6666 7777 8888 9999',
      fun: change8
    },
    {
      title: '如下图所示，在拍发时漏拍了第二行报文，请进行更正。',
      type: 1,
      value: '',
      value2: '',
      code: [
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '1234',
        '1234',
        '1234',
        '1234',
        '1234',
        '1234',
        '1234',
        '1234',
        '1234',
        '1234',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999-1'
      ],
      anwser:
        '0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999-1',
      compileCode:
        '0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999-1',
      fun: change9
    },
    {
      title: '如下图所示，在拍发时多拍了一行报文，请进行更正.',
      type: 1,
      value: '',
      code: [
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999',
        '0000',
        '1111',
        '2222',
        '3333',
        '4444',
        '5555',
        '6666',
        '7777',
        '8888',
        '9999'
      ],
      anwser:
        '0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 1234 1234 1234 1234 1234 1234 1234 1234 1234 1234 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999',
      compileCode:
        '0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 1234 1234 1234 1234 1234 1234 1234 1234 1234 1234 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999',
      fun: change10
    },
    {
      title: '如下图所示，在拍发时忘记了标页,且已回动换行，请进行更正。',
      value: '',
      code: ['...(90)', '0000', '1111', '2222', '3333', '4444', '5555', '6666', '7777', '8888', '9999-1'],
      anwser: '...(90) 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999',
      compileCode: '...(90) 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999',
      fun: change11
    },
    {
      title: '如下图所示，在拍发时标页错误,且已回动换行，请进行更正。',
      value: '',
      code: ['...(90)', '0000', '1111', '2222', '3333', '4444', '5555', '6666', '7777', '8888', '9999-1'],
      anwser: '...(90) 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999',
      compileCode: '...(90) 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999-3',
      fun: change11
    },
    {
      title: '如下图所示，在拍发时标页错误,且已拍发间隔，请进行更正。',
      value: '...(90) 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 ',
      code: ['...(90)', '0000', '1111', '2222', '3333', '4444', '5555', '6666', '7777', '8888', '9999-1'],
      anwser: '...(90) 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 ',
      compileCode: '...(90) 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999 ',
      fun: change13
    },
    {
      title: '如下图所示，在拍发时标页错误,但是未拍发间隔和换行，请进行更正。',
      value: '...(90) 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999-2',
      code: ['...(90)', '0000', '1111', '2222', '3333', '4444', '5555', '6666', '7777', '8888', '9999-1'],
      anwser: '...(90) 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999-2',
      compileCode: '...(90) 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999-2',
      fun: change14
    },
    {
      title: '如下图所示，在拍发完第二页报文时，发现第一页标页错误，请进行更正。',
      value: '',
      code: ['...(90)', '0000', '1111', '2222', '3333', '4444', '5555', '6666', '7777', '8888', '9999-1', '...(199)', '2000-2'],
      anwser: '1P 95 4444',
      compileCode: '...(90) 0000 1111 2222 3333 4444 5555 6666 7777 8888 9999-2 ...(199) 2000-2',
      fun: change6
    }
  ]
}
function change1(v) {
  if (v.value.length < v.anwser.length) {
    v.value = v.anwser
  }
  const arr = v.value.split(' ')
  let str = ''
  for (let i = 0; i < 10; i++) {
    if (!arr[i]) {
      arr[i] = ''
    }
  }
  arr.forEach(item => {
    if (item.indexOf('/') > -1) {
      item = item.split('/')[1]
    }
    str += str.length > 0 ? ' ' + item : item
  })
  v.compileCode = str
}
function change2(v) {
  if (v.value.length < v.anwser.length) {
    v.value = v.anwser
  }
  const arr = v.value.split(' ')
  for (let i = 0; i < 10; i++) {
    if (!arr[i]) {
      arr[i] = ''
    }
  }
  let str = ''
  arr.forEach(item => {
    if (item.indexOf('/') > -1 && item.length == 4 && item[3] == '/') {
    } else {
      str += str.length > 0 ? ' ' + item : item
    }
  })
  const a = str.split(' ')
  if (a.length < 10) {
    str += ' '
  }
  v.compileCode = str.length > 0 ? str : v.compileCode
}
function change3(v) {
  if (v.value.length < v.anwser.length) {
    v.value = v.anwser
  }
  const arr = v.value.split(' ')
  let str = ''
  for (let i = 0; i < 10; i++) {
    if (!arr[i]) {
      arr[i] = ''
    }
  }
  arr.forEach((item, index) => {
    if (item.indexOf('/') > -1 && item.length == 4) {
      arr.splice(index - 1, 2)
    }
  })
  arr.forEach(item => {
    str += str.length > 0 ? ' ' + item : item
  })
  const a = str.split(' ')
  for (let i = 0; i < 10 - a.length; i++) {
    str += ' '
  }
  v.compileCode = str
}
function change4(v) {
  if (v.value.length < v.anwser.length) {
    v.value = v.anwser
  }
  let str = ''
  const arr = v.value.split(' ')
  const subScript = arr[arr.length - 2]
  const code = arr[arr.length - 1]
  arr.forEach((item, index) => {
    if (index < 10) {
      if (index == subScript - 1) {
        item = code
      }
      str += str.length > 0 ? ' ' + item : item
    }
  })
  v.compileCode = str
}
function change5(v) {
  let str = ''
  const a = v.value.split(' ')
  const subScript = a[0] - 90
  const code = a[1]
  const arr = v.compileCode.split(' ')
  if (subScript > 0) {
    arr[subScript] = code ? code : ''
  }
  arr.forEach(item => {
    str += str.length > 0 ? ' ' + item : item
  })
  v.compileCode = str
}
function change6(v) {
  let str = ''
  const a = v.value.split(' ')
  if (a[0] == '1P') {
    const subScript = a[1] - 90
    const code = a[2]
    const arr = v.compileCode.split(' ')
    if (subScript > 0) {
      arr[subScript] = code ? code : ''
    }
    arr.forEach(item => {
      str += str.length > 0 ? ' ' + item : item
    })
    v.compileCode = str
  }
}
function change7(v) {
  if (v.value.length < v.anwser.length) {
    v.value = v.anwser
  }
  let str = ''
  const arr = v.value.split(' ')
  const l = arr.length
  if (arr[l - 3] == 'add' && arr[l - 2] <= 10 && l == 13) {
    const a = v.compileCode.split(' ')
    a[arr[l - 2] - 1] = arr[l - 1]
    a.forEach(item => {
      str += str.length > 0 ? ' ' + item : item
    })
    v.compileCode = str
  }
}
function change8(v) {
  if (v.value.length < v.anwser.length) {
    v.value = v.anwser
    v.compileCode = v.anwser
  }
  let str = ''
  const arr = v.value.split(' ')
  const l = arr.length
  if (arr[l - 2] == 'qta' && arr[l - 1] > 0 && arr[l - 1] <= 11 && l == 13) {
    const a = v.compileCode.split(' ')
    a.splice(arr[l - 1] - 1, 1)
    a.forEach(item => {
      str += str.length > 0 ? ' ' + item : item
    })
    v.compileCode = str
  }
}
function change9(v) {
  const arr = v.value.split(' ')
  if (arr.length != 2 || arr[0] != 'add') {
    return false
  }
  const subscript = arr[1].split('---')
  if (subscript.length != 2) {
    return false
  }
  const num = subscript[1] - subscript[0]
  const arr2 = v.value2.split(' ')
  const arr3 = v.anwser.split(' ')
  for (let i = 0; i <= num; i++) {
    arr3.splice(subscript[0] - 1 + i, 0, arr2[i] ? arr2[i] : ' ')
  }
  let str = ''
  arr3.forEach(item => {
    str += str.length > 0 && item !== ' ' ? ' ' + item : item
  })
  v.compileCode = str
}
function change10(v) {
  const arr = v.value.split(' ')
  if (arr.length != 2 || arr[0] != 'qta') {
    return false
  }
  const subscript = arr[1].split('---')
  if (subscript.length != 2) {
    return false
  }
  const num = subscript[1] - subscript[0]
  const arr3 = v.anwser.split(' ')
  arr3.splice(subscript[0] - 1, num + 1)
  let str = ''
  arr3.forEach(item => {
    str += str.length > 0 && item !== ' ' ? ' ' + item : item
  })
  v.compileCode = str
}
function change11(v) {
  let str = ''
  const a = v.value.split(' ')
  const subScript = a[0] - 90
  const code = a[1]
  const arr = v.anwser.split(' ')
  if (subScript > 0) {
    arr[subScript] = code ? code : ''
  }
  arr.forEach(item => {
    str += str.length > 0 ? ' ' + item : item
  })
  v.compileCode = str
}
function change13(v) {
  if (v.value.length < v.anwser.length) {
    v.value = v.anwser
    return
  }
  let str = ''
  const a = v.value.split(' ')
  if (a.length == 13 && a[12]) {
    const arr = v.anwser.split(' ')
    if (a[a.length - 2] == '////' && a[12]) arr[arr.length - 2] = a[12]
    arr.forEach(item => {
      str += str.length > 0 ? ' ' + item : item
    })
    v.compileCode = str.trim()
  } else {
    v.compileCode = v.value
  }
}
function change14(v) {
  if (v.value.length < v.anwser.length) {
    v.value = v.anwser
    return
  }
  let str = ''
  const a = v.value.split(' ')
  const arr = v.anwser.split(' ')

  if (a[a.length - 1].indexOf('/') > -1) {
    const nums = a[a.length - 1].split('/')
    arr[arr.length - 1] = nums[1] ? arr[arr.length - 1].split('-')[0] + '-' + nums[1] : arr[arr.length - 1]
  }
  arr.forEach(item => {
    str += str.length > 0 ? ' ' + item : item
  })
  v.compileCode = str
}
